-- phpMyAdmin SQL Dump
-- version 4.8.3
-- https://www.phpmyadmin.net/
--
-- 主机： localhost:3306
-- 生成日期： 2020-01-23 05:37:52
-- 服务器版本： 5.7.24
-- PHP 版本： 7.3.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `assign1`
--

-- --------------------------------------------------------

--
-- 表的结构 `书本影视化`
--

CREATE TABLE `书本影视化` (
  `名称` varchar(50) DEFAULT NULL,
  `主演` varchar(50) DEFAULT NULL,
  `影视化` varchar(50) DEFAULT NULL,
  `上映日期` date DEFAULT NULL,
  `评分` int(1) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `书本影视化`
--

INSERT INTO `书本影视化` (`名称`, `主演`, `影视化`, `上映日期`, `评分`) VALUES
('八墓村', '稻垣吾郎', '电影', '2004-10-01', 4),
('白夜行', '绫濑遥；山田孝之', '电影', '2006-01-12', 5),
('点与线', '北野武；高桥克典', '连续剧', '2007-11-24', 4),
('告白', '松隆子', '电影', '2010-06-05', 5),
('姑获鸟之夏', '堤真一', '电影', '2005-07-16', 3),
('黑色皮革手册', '武井咲；江口洋介', '连续剧', '2017-07-20', 4),
('幻夜', '深田恭子；塚本高史', '连续剧', '2010-11-21', 3),
('假面饭店', '木村拓哉；长泽雅美', '电影', '2019-01-01', 4),
('解忧杂货店', '山田凉介；西田敏行', '电影', '2017-09-23', 4),
('零的焦点', '广末凉子；中谷美纪；木村多江', '电影', '2009-11-14', 4),
('黎明之街', '岸谷五郎；深田恭子', '电影', '2011-10-08', 3),
('流星之绊', '二宫和也；锦户亮；户田惠梨香', '连续剧', '2008-10-17', 4),
('乐园', '仲间由纪惠；黑木瞳', '连续剧', '2017-01-08', 3),
('模仿犯', '中谷美纪；坂口健太郎', '连续剧', '2016-09-21', 4),
('秘密', '广末凉子；小林薰', '电影', '1999-09-25', 4),
('名侦探的守则', '松田翔太；香锥由宇', '连续剧', '2009-04-17', 3),
('砂器', '中居正广；渡边谦', '连续剧', '2004-01-18', 4),
('替身', '桥本爱；山崎贤人', '电影', '2012-08-04', 3),
('为了N', '仓荣奈奈；洼田正孝', '连续剧', '2014-10-17', 5),
('魍魉之匣', '堤真一', '电影', '2007-12-22', 3),
('嫌疑人x的献身', '福山雅治；堤真一', '电影', '2008-10-04', 4),
('狱门岛', '长谷川博己', '连续剧', '2016-11-16', 3);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
